FoamProject/poiseuilleFlow/stable_re1000ny20/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam; // Problem is steady state, so no point in using transient solver

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10000; // # of iterations

deltaT          1;

writeControl    timeStep;

writeInterval   1; 

purgeWrite      1; // Only interested in final solution, so no point in storing intermediate results

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


// ************************************************************************* //
